femat7/tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/0.orig/include/baffle3DSetup
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

baffleRegionName    baffle3DRegion;

masterPatchName     baffle3DRegionMaster;

slavePatchName      baffle3DRegionSlave;

oneD                false;

nLayers             50;

thickness           0.02;

Kappa               0.01;

Cp                  15;

rho                 80;

// ************************************************************************* //
